In [15]:
# series

# imports
import numpy as np
import pandas as pd

# Creating labels and data
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]


# Creating Series
def create_series(data, index=None):
    return pd.Series(data, index=index)


# Printing Series
print(create_series(my_data))
print(create_series(my_data, labels))

# Series with countries
ser = create_series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
print(ser)

# Accessing Series by key
print(ser['USA'])

# Creating DataFrame demo
df = pd.DataFrame({
    'Country': ['USA', 'Germany', 'Italy', 'Japan'],
    'Values': [1, 2, 5, 4]
})
print(df)
df

0    10
1    20
2    30
dtype: int64
a    10
b    20
c    30
dtype: int64
USA        1
Germany    2
USSR       3
Japan      4
dtype: int64
1
   Country  Values
0      USA       1
1  Germany       2
2    Italy       5
3    Japan       4

   Country  Values
0      USA       1
1  Germany       2
2    Italy       5
3    Japan       4

## Dataframes - Part 1

In [16]:
from numpy.random import randn

np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
w_column = df['W']
print(w_column)
print(type(w_column))

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64
<class 'pandas.core.series.Series'>

In [21]:
df['AA'] = df['W'] + df['Y']

In [23]:
df.drop('new', axis=1, inplace=True)

In [24]:
df

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

If we use `inplace` on `df.drop` we are changing the original dataframe. If we don't use `inplace` we are not changing the original dataframe. We are just returning a new dataframe.

```python
df.drop('column_name', axis=1, inplace=True)
```

In [25]:
df.drop('E', axis=0)

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [27]:
df.shape

(5, 5)

In [28]:
df[['Z', 'X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [29]:
df.loc['A']

W     2.706850
X     0.628133
Y     0.907969
Z     0.503826
AA    3.614819
Name: A, dtype: float64

In [30]:
df.iloc[2]

W    -2.018168
X     0.740122
Y     0.528813
Z    -0.589001
AA   -1.489355
Name: C, dtype: float64

In [31]:
df.loc['B', 'Y']

-0.8480769834036315

In [32]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Dataframes - Part 2

In [33]:
df

          W         X         Y         Z        AA
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('AA', axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [36]:
bool_df = df > 0
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [38]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
result_df = df[df['Z'] < 0]

In [41]:
result_df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
result_df['X']

C    0.740122
Name: X, dtype: float64

In [43]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [44]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [45]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
new_ind = 'CA NY WY OR CO'.split()
df['States'] = new_ind

In [49]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [50]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [51]:
df.reset_index(inplace=True)

In [52]:
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO